CFD/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     cfdemSolverPiso;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         20;

deltaT          0.0025;

writeControl    adjustableRunTime;

writeInterval   0.005;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression uncompressed;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  no;

maxCo           0.8;

functions
{
    probes
    {
        type            probes;
        functionObjectLibs ( "libsampling.so" );
        name            probes;
        probeLocations
        (
            (0.135 -0.070  0.000)
            (0.070  0.000  0.000)
            (0.040  0.000 -0.120)
            (0.000  0.000  0.100)
        );
        fields          ( p U voidfraction );
        outputControl   timeStep;
        outputInterval  1;
    }

    volFlow_inlet
    {
        type            surfaceFieldValue;
        functionObjectLibs ("libfieldFunctionObjects.so");
        outputControl   timeStep;
        outputInterval  1;
        log             true;
        writeFields     false;
        valueOutput     false;
        regionType      patch;
        name            inlet;
        operation       sum;
        fields          ( phi );
    }

    volFlow_outlet
    {
        type            surfaceFieldValue;
        functionObjectLibs ("libfieldFunctionObjects.so");
        outputControl   timeStep;
        outputInterval  1;
        log             true;
        writeFields     false;
        valueOutput     false;
        regionType      patch;
        name            outlet;
        operation       sum;
        fields          ( phi );
    }
}

// ************************************************************************* //
