CFD/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.0                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
// Background mesh for the cyclone STL (body ~ x/y +/-0.160, z -0.600 to 0.172).
// snappyHexMesh keeps only the fluid region selected by locationInMesh.

convertToMeters 1;

vertices
(
    (-0.18 -0.18 -0.62)
    ( 0.18 -0.18 -0.62)
    ( 0.18  0.18 -0.62)
    (-0.18  0.18 -0.62)
    (-0.18 -0.18  0.19)
    ( 0.18 -0.18  0.19)
    ( 0.18  0.18  0.19)
    (-0.18  0.18  0.19)
);

blocks
(
    // Base cell size ~11 mm; Z count raised for deeper bin (domain height 0.81 m).
    hex (0 1 2 3 4 5 6 7) (34 34 74) simpleGrading (1 1 1)
);

edges
(
);

patches
(
    wall background
    (
        (0 4 5 1)
        (1 5 6 2)
        (2 6 7 3)
        (3 7 4 0)
        (0 1 2 3)
        (4 7 6 5)
    )
);

mergePatchPairs
(
);

// ************************************************************************* //
