CFD/system/snappyHexMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      snappyHexMeshDict;
}

castellatedMesh true;
snap            true;
addLayers       false;

geometry
{
    body.stl
    {
        type triSurfaceMesh;
        name body;
    }
    inlet.stl
    {
        type triSurfaceMesh;
        name inlet;
    }
    outlet.stl
    {
        type triSurfaceMesh;
        name outlet;
    }
}

castellatedMeshControls
{
    maxLocalCells       200000;
    maxGlobalCells      750000;
    minRefinementCells  0;
    nCellsBetweenLevels 2;
    resolveFeatureAngle 30;

    features ();

    refinementSurfaces
    {
        body
        {
            level (1 1);
            patchInfo
            {
                type wall;
            }
        }
        inlet
        {
            level (1 1);
            patchInfo
            {
                type patch;
            }
        }
        outlet
        {
            level (1 1);
            patchInfo
            {
                type patch;
            }
        }
    }

    refinementRegions {}

    // Inside the tangential inlet duct, downstream of the inlet cap.
    locationInMesh (0.135 -0.07 0);
    allowFreeStandingZoneFaces true;
}

snapControls
{
    nSmoothPatch 5;
    tolerance    2.0;
    nSolveIter   50;
    nRelaxIter   8;
    nFeatureSnapIter 10;
    implicitFeatureSnap false;
    explicitFeatureSnap false;
    multiRegionFeatureSnap false;
}

addLayersControls
{
    relativeSizes true;
    layers {};
    expansionRatio 1.0;
    finalLayerThickness 0.3;
    minThickness 0.1;
    nGrow 0;
    featureAngle 60;
    nRelaxIter 3;
    nSmoothSurfaceNormals 1;
    nSmoothNormals 3;
    nSmoothThickness 10;
    maxFaceThicknessRatio 0.5;
    maxThicknessToMedialRatio 0.3;
    minMedianAxisAngle 90;
    nBufferCellsNoExtrude 0;
    nLayerIter 50;
}

meshQualityControls
{
    #include "meshQualityDict"
}

debug 0;
mergeTolerance 1e-6;
